Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::PreferenceTableBase Class Referencefinal
MEP Element Manager
The PreferenceTableBase represents a named entity, that contains inner tables associated with cross section shapes and these table contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order. More...
#include <MEPPreferenceTableBase.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PreferenceTableBase:
 Public Member Functions
bool  | Exists () const
GS::UniString  | GetName () const
Result< uint32_t >  | GetSize (PreferenceTableShape shape) const
Result< double >  | GetValue (PreferenceTableShape shape, uint32_t index) const
Result< GS::UniString >  | GetDescription (PreferenceTableShape shape, uint32_t index) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetName (const GS::UniString &tableName)
Sets the name of the table.
Result< uint32_t >  | AddNewPreference (PreferenceTableShape shape)
Inserts a new empty line in the table.
Result< void >  | Delete (PreferenceTableShape shape, uint32_t index)
Deletes a row from the table.
Result< uint32_t >  | SetValue (PreferenceTableShape shape, uint32_t index, double value)
Sets the value of a table's row.
Result< void >  | SetDescription (PreferenceTableShape shape, uint32_t index, const GS::UniString &description)
Sets the description of a table's row.
 Static Public Member Functions
static Result< PreferenceTableBase >  | Get (const UniqueID &uniqueId)
Returns a PreferenceTableBase.
 Protected Member Functions
Modifier (PreferenceTableBase &)
 void  | FinalizeModification () override
Detailed Description
The PreferenceTableBase represents a named entity, that contains inner tables associated with cross section shapes and these table contains rows that consists of a size and a description. The rows have to be unique by value and are always in ascending order.
Since
Archicad 27
For every domain the shapes are as follows: Duct - Rectangular and Circular Pipe - Circular CableCarrier - Rectangular This means, that by adding/getting a PreferenceTable, it will already contain one or two inner shape-tables, depending on the domain. These could be empty, but you cannot add new shapes to a PreferenceTableBase, nor delete them.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Member Function Documentation
◆ AddNewPreference()
 Result< uint32_t > ACAPI::MEP::v1::PreferenceTableBase::AddNewPreference  |  ( |  PreferenceTableShape  |  shape | )
Inserts a new empty line in the table.
Parameters
shape | The shape of the table to insert into.
Returns
Returns error if the shape is not defined for the PreferenceTable, otherwise returns the index of the newly inserted row. Do not forget to set a value to it afterwards, otherwise it will be automatically deleted at the end of the Modify scope.
◆ Delete()
 Result< void > ACAPI::MEP::v1::PreferenceTableBase::Delete  |  ( |  PreferenceTableShape  |  shape,
|  uint32_t  |  index
)
Deletes a row from the table.
Parameters
shape | The shape of the table to delete from.
index | The index of the row. Index starts from 0.
Returns
Returns error if the shape is not defined for the PreferenceTable or the index is out of range, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::PreferenceTableBase::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< PreferenceTableBase > ACAPI::MEP::v1::PreferenceTableBase::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a PreferenceTableBase.
Parameters
uniqueId | The UniqueID of the requested PreferenceTableBase.
Returns
If the uniqueId belongs to a PreferenceTable, returns the object associated to it, otherwise Error.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::v1::PreferenceTableBase::GetDescription  |  ( |  PreferenceTableShape  |  shape,
|  uint32_t  |  index
) |   |  const
Parameters
shape | The shape of the preference table.
index | The index of the row. Index starts from 0.
Returns
Returns error if the shape is not defined for the PreferenceTable, otherwise returns the description of a table's row of the inner shape-table.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::PreferenceTableBase::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetSize()
 Result< uint32_t > ACAPI::MEP::v1::PreferenceTableBase::GetSize  |  ( |  PreferenceTableShape  |  shape | ) |   const
Parameters
shape | The shape of the table.
Returns
Returns error if the shape is not defined for the PreferenceTable, otherwise returns the size of the inner shape-table.
◆ GetValue()
 Result< double > ACAPI::MEP::v1::PreferenceTableBase::GetValue  |  ( |  PreferenceTableShape  |  shape,
|  uint32_t  |  index
) |   |  const
Parameters
shape | The shape of the preference table.
index | The index of the row. Index starts from 0.
Returns
Returns error if the shape is not defined for the PreferenceTable, otherwise returns the value of a table's row of the inner shape-table.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PreferenceTableBase::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetDescription()
 Result< void > ACAPI::MEP::v1::PreferenceTableBase::SetDescription  |  ( |  PreferenceTableShape  |  shape,
|  uint32_t  |  index,
|  const GS::UniString &  |  description
)
Sets the description of a table's row.
Parameters
shape | The shape of the preference table.
index | The index of the row. Index starts from 0.
description | The description to be set.
Returns
Returns error if the shape is not defined for the PreferenceTable or the index is out of range, otherwise nothing.
◆ SetName()
 void ACAPI::MEP::v1::PreferenceTableBase::SetName  |  ( |  const GS::UniString &  |  tableName | )
Sets the name of the table.
Parameters
tableName | The name to be set.
◆ SetValue()
 Result< uint32_t > ACAPI::MEP::v1::PreferenceTableBase::SetValue  |  ( |  PreferenceTableShape  |  shape,
|  uint32_t  |  index,
|  double  |  value
)
Sets the value of a table's row.
Parameters
shape | The shape of the preference table.
index | The index of the row. Index starts from 0.
value | The value to be set. Must be a non-zero positive number.
Returns
Returns error if the shape is not defined for the PreferenceTable, the index is out of range or if the new value would be a duplicate, otherwise returns the new index of the modified row.